#include "estr.h"

/******************************************************************************
*  ASR => 4R2.04                                                              *
*******************************************************************************
*                                                                             *
*  N° de Sujet : 01                                                           *
*                                                                             *
*******************************************************************************
*                                                                             *
*  Intitulé : Analyse de trame GPS                                            *
*                                                                             *
*******************************************************************************
*                                                                             *
*  Nom-prénom1 : Allart Mathéo                                                *
*                                                                             *
*  Nom-prénom2 : Vallette Noé                                                 *
*                                                                             *
*  Nom-prénom3 :                                                              *
*                                                                             *
*  Nom-prénom4 :                                                              *
*                                                                             *
*******************************************************************************
*                                                                             *
*  Nom du fichier : estr.c                                                    *
*                                                                             *
******************************************************************************/

char* str_poly_concat(int n_args, ...)
{
    va_list arg;
    va_start(arg, n_args);
    char* result = va_arg(arg, char*);
    for (int i = 1; i < n_args; ++i)
        result = str_concat(result, va_arg(arg, char*));
    va_end(arg);
    return result;
}
